# Task 2.3
# shlom41k

"""
# Создать строку равную первым пяти символам введенной строки
"""


# Read string from console
s = input()

# New string
s_new = s[:5]

print("Input string:", s)
print("Firs 5 symbols:", s_new)