# Task 2.1
# shlom41k

"""
# Создать строку равную третьему символу введенной строки.
"""


# Read string from console
s = input()

# New string
s3 = s[2]

print("Input string:", s)
print("Third symbol:", s3)