# Task 2.2
# shlom41k

"""
# Создать строку равную предпоследнему символу введенной строки
"""


# Read string from console
s = input()

# New string
s_new = s[-2]

print("Input string:", s)
print("The last but one:", s_new)