# Task 2.4
# shlom41k

"""
# Создать строку равную введенной строку без последних двух символов.
"""


# Read string from console
s = input()

# New string
s_new = s[:-2]

print("Input string:", s)
print("New string:", s_new)