# Task 1.3
# shlom41k

"""
# Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности.
"""


# Длина ребра куба
a = 4

# Объем куба
v = a ** 3

# Площадь боковой поверхности
s = 6 * a ** 2

print("a =", a)
print("V =", v)
print("S =", s)