# Task 1.4
# shlom41k

"""
# Даны два действительных числа. Найти среднее арифметическое и среднее геометрическое этих чисел.
"""


a, b = 2, 3

meaa_oriph = (a + b) / 2
mean_geom = (a * b) ** 0.5

print("a =", a, "b =", b)
print("Среднее арифметическое =", meaa_oriph)
print("Среднее геометрическое =", mean_geom)